Autodesk.Revit.DB.DistributionOfNormals
Since:
2014
An enumeration containing the choices of how normal vectors are assigned
and distributed along the surface of a polymesh. Planar faces would typically
have only normal vector associated, but curved faces can have a different
normal either for each facet (triangle) or each point of the tessellated polymesh.
Since:
2014

Autodesk.Revit.DB.DistributionOfNormals.OnEachFacet
There is one normal vector per each facet of the polymesh.

Autodesk.Revit.DB.DistributionOfNormals.OnePerFace
There is only one common normal vector assigned to the face/polymesh.

Autodesk.Revit.DB.DistributionOfNormals.AtEachPoint
One normal vector is assigned to each vertex of the polymesh.